---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.FluidTemperature
source: html/e0405486-d484-48cb-716f-5c9ebe6dfcaa.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperature

Represents the dynamic viscosity and density properties as defined at a certain temperature.

## Syntax (C#)
```csharp
public class FluidTemperature : IDisposable
```